# ЧЕК-ЛИСТ ПРОВЕРОК:
                    # позитив положительный:
# 100
# 999
# 000
# 99 - в цикле 100
# 1000 - в цикле 999
# 99 - в цикле 99 - в цикле 100
# 1000 - в цикле 1000 - в цикле 999
                    # позитив отрицательный:
# -100
# -999
# -99 - в цикле -100
# -1000 - в цикле -999
# -99 - в цикле -99 - в цикле -100
# -1000 - в цикле -1000 - в цикле -999
                    # негативные проверки:
# пустой ввод
# три пробела
# буквы
# символы
# 2 пробела и 1 цифра
# 1 пробел и 2 цифры
#